'use client';

import React, { useEffect, useState } from 'react';
import * as S from './page.styled';
import { ReceiptText } from 'lucide-react';
import { ArrowRight } from 'lucide-react';
const TermsPage = () => {
  const [data, setData] = useState(null);

  // if (!data) {
  //   return <div>Loading...</div>;
  // }

  return (
    <S.TermsContainer>
     
        <S.TermsTitle>
      <S.Link href='http://dev.korpus.am/en'>Korpus</S.Link>  կայքի օգտագործման ընդհանուր դրույթներ և պայմաններ
        <ReceiptText size={32}/>
        </S.TermsTitle>
        <S.TermsSubTitle>
        1.	ՆԵՐԱԾՈՒԹՅՈՒՆ
        </S.TermsSubTitle>
        <S.TermsList>
        <S.TermsListPoint>
        1.1.  <S.Link href='http://dev.korpus.am/en'>Korpus</S.Link> կայքը /այսուհետ՝ Կայք/ պատկանում և տնօրինվում է «ՆԵԿԱ» սահմանափակ պատասխանատվությամբ ընկերության (ՀՎՀՀ՝ 04425252, Պետ․ գրանցման համար՝ 99.110.930365 (այսուհետ՝ Կայքի իրավատեր կամ Ընկերություն) կողմից:
        </S.TermsListPoint>
        <S.TermsListPoint>
        1.2.  Կայքի օգտագործման սույն ընդհանուր դրույթները և պայմանները (այսուհետ՝ ԸԴՊ) կարգավորում են Կայքի իրավատիրոջ կողմից անձի համար (ֆիզիկական անձ կամ կազմակերպաիրավական ցանկացած տեսակի իրավաբանական անձ) Կայքում առաջարկվող նյութերով և պարամետրերով աշխատանքների կատարման ընդհանուր դրույթներն ու պայմանները, անձի կողմից Կայքի ցանկացած մուտքը և օգտագործումը և համարվում են Պայմանագրի անբաժանելի մասը: ԸԴՊ-ով վերահսկվում է Կայքի կիրառումը բոլոր Օգտատերերի և Այցելուների կողմից։
        </S.TermsListPoint>
        <S.TermsListPoint>
        1.3.  ԸԴՊ-ն հանդիսանում է պայմանագրի անբաժանելի մասը և  սահմանվում են Կայքի իրավատիրոջ կողմից և հանդիսանում են կահույքի մասերի (դետալների) և ապրանքների պատրաստման (աշխատանքների կատարման), մատակարարման պայմանագիր կնքելու հրապարակային օֆերտա (առաջարկ):
        </S.TermsListPoint>
        <S.TermsListPoint>
        1.4.  Կայքի իրավատիրոջ կողմից առաջարկվող ցանկացած ծառայությունից օգտվելու օֆերտան համարվում է ակցեպտավորված (հաստատված) Կայքում Օգտատիրոջ և/կամ Այցելուի գրանցման պահից և այդ պահից համարվում է օֆերտան ընդունած (պայմանագիր կնքած), որն էլ համարվում է Կայքի իրավատիրոջ և Օգտատիրոջ միջև կնքված և կատարման համար պարտադիր պայմանագիր (այսուհետ` Պայմանագիր) և առաջացնում է Օգտատերերի կողմից ԸԴՊ-ով սահմանված կանոնների պահպանման պարտավորություն: Օգտատիրոջ գրանցումը Կայքում և Կայք մուտք գործելիս օգտատիրոջ կողմից Կայքի օգտատործման պայմանագիրը ստորագրելը նշանակում է, որ Օգտատերը անվերապահորեն և ամբողջությամբ ընդունում է  Պայմանագիրը և ԸԴՊ-ն (օֆերտայի ակցեպտ)։
        </S.TermsListPoint>
        <S.TermsListPoint>1.5.  Կայքի միջոցով օգտատերը կարող է իրականացնել պատվեր կայքում ցուցադրված աշխատանքների ցանկից։</S.TermsListPoint>
        <S.TermsListPoint>1.6.  Դառնալով Օգտատեր՝ անձն ընդունում է Պայմանագրի և ԸԴՊ-ի դրույթները։</S.TermsListPoint>
        <S.TermsListPoint>1.7.  Պայմանագրում, ԸԴՊ-ում  և Կայքում՝ այդ թվում անձնական էջում, որոշ բառեր կամ արտահայտություններ կարող են օգտագործվել օտարալեզու՝ ռուսերեն և անգլերեն լեզուներով կամ դրանց հայերեն տառադարձությամբ։</S.TermsListPoint>
        </S.TermsList>
        <S.TermsSubTitle>
        2.	ՀԱՍԿԱՑՈՒԹՅՈՒՆՆԵՐ
        </S.TermsSubTitle>
        <S.TermsList>
        <S.TermsListPoint>2.1.    Կայք ՝ <S.Link href='http://dev.korpus.am/en'>Korpus</S.Link></S.TermsListPoint>
        <S.TermsListPoint>2.2.  	<b>Կայքի իրավատեր</b> կամ <b>Ընկերություն՝</b> «ՆԵԿԱ» սահմանափակ պատասխանատվությամբ ընկերություն (ՀՎՀՀ՝ 04425252, պետական գրանցման համար՝ 99.110.930365 )</S.TermsListPoint>
        <S.TermsListPoint>2.3.    <b>Օգտատեր՝</b> ֆիզիկական կամ իրավաբանական անձ, որն իր կամահայտությունը արտահայտելով և համաձայնություն տալով սույն Պայմանագրով և ԸԴՊ-ով սահմանված դրույթներին, գրանցվել է «www.Korpus.am» կայքում:</S.TermsListPoint>
        <S.TermsListPoint>2.4.  	<b>Անհատական առաջադրանքով պատվեր՝</b> (այսուհետ նաև՝ <b>Պատվեր</b>)՝ Օգտատիրոջ կողմից համապատասխան նյութի, չափերի, գույնի, դետալների և այլ պարամետրերի ընտրությամբ աշխատանքի պատվեր, որի արդյունքում Ընկերությունը կատարում է որոշակի աշխատանք՝ պաստրաստի արդյունքը Օգտատիրոջը փոխանցելու համար։</S.TermsListPoint>
        <S.TermsListPoint>2.5.  	<b>Աշխատանքի վերջնական արդյունք կամ ապրանք՝</b> Օգտատիրոջ  անհատական առաջադրանքով պատվերի հիման վրա պատրաստված ապրանք։</S.TermsListPoint>
        <S.TermsListPoint>2.6.    <b>Առկա ապրանք՝</b> կահույքի մոդուլներ և ամբողջական կահույք, որոնք նախապես պատարաստված են Ընկերության կողմից և տեղադրված են Կայքում որպես առկա վաճառքի տեսականի։</S.TermsListPoint>
        <S.TermsListPoint>2.7.  	<b>Ապրանքի դեֆեկտ (թերություն)`</b> ապրանքի (աշխատանքի) անհամապատասխանությունը նորմատիվ փաստաթղթերին, պայմանագրի,  պայմաններին կամ ապրանքի (աշխատանքի) որակին սովորաբար ներկայացվող պահանջներին։
        </S.TermsListPoint>
        <S.TermsListPoint>2.8.  	<b>Պայմանագիր՝</b> Կայք մուտք գործելիս օգտատիրոջ կողմից ստորագրվող Համաձայնագիրը / պայմանագիրը, որի անբաժանելի մասն են կազմում՝ սույն ԸԴՊ-ն և դրա հետագա բոլոր փոփոխությունները, լրացումները և հավելվածները, ինչպես նաև՝ կողմերի միջև կնքվող լրացուցիչ համաձայնագիրը:
        </S.TermsListPoint>
        <S.TermsListPoint>2.9.  	<b>Այցելու՝</b> ֆիզիկական և/կամ իրավաբանական անձ, ով Կայքում հնարավորություն ունի առանց գրանցվելու միայն դիտել (առանց պատվեր տալու) և ուսումնասիրել Կայքում տեղադրված տեղեկատվությունը։</S.TermsListPoint>
        <S.TermsListPoint>2.10.  <b>Մշտական հաճախորդ՝</b> անձ, ով լոյալություն ցուցաբերելով, հաճախ է օգտվում Ընկերության կողմից մատուցված ծառայություններից, աշխատանքներից և ապրանքներից։</S.TermsListPoint>
        <S.TermsListPoint>2.11.  <b>Օգտատիրոջ մուտքանուն (LOGIN)՝</b> օգտատիրոջը նույնականացնող նիշերի (տառերի, թվերի և նշանների) համադրություն, որն ընտրվում է Օգտատիրոջ կողմից Կայքում գրանցվելու համար և, որը տարբերակում է յուրաքանաչյուր առանձին վերցրած Օգտատիրոջը Կայքի այլ Օգտատերերից։ Որպես մուտքանուն կարող է հանդես գալ Օգտատիրոջ անձնական էլեկտրոնային հասցեն կամ հեռախոսահամարը:
        </S.TermsListPoint>
        <S.TermsListPoint>2.12. <b>Օգտատիրոջ գաղտնաբառ (Password)՝</b> որոշակի նիշերի (տառերի, թվերի և սիմվոլների գործածմամբ) համադրություն, որն ընտրվում է Օգտատիրոջ կողմից, հայտնի է միայն Օգտատիրոջը, օգտագործվում է միայն Կայք մուտք գործելու համար և կոդավորված ձևով պահվում է Կայքում, որը երրորդ անձանց հասանելի չէ:</S.TermsListPoint>
        <S.TermsListPoint>2.13. <b>Ծառայություն և/կամ Աշխատանք՝</b> Ընկերության կողմից Կայքի միջոցով՝ Պայմանագրով և ԸԴՊ-ով սահմանված վաճառվող ապրանքը կամ մատուցվող Ծառայությունները կամ կատարվող աշխատանքը։</S.TermsListPoint>
        <S.TermsListPoint>2.14. <b>Կայքի Ադմին կամ Ադմինիստրացիա (Admin)՝</b> Կայքի ներկայացուցիչները և Ընկերության վաճառքի մենեջերները, ովքեր իրականացնում են Կայքի տեխնիկական աշխատանքները և ապահովում են Կայքի պատշաճ և անխափան աշխատանքը, Օգտատերերին տրամադրում են խորհրդատվություն Կայքի տեխնիկական հարցերի վերաբերյալ, բացառությամբ Օգտատիրոջ սարքավորումների կարգաբերմանն առնչվող խնդիրների կամ Կայքին և Կայքում տեղադրված հայտարարություններին ուղղակիորեն չվերաբերող հարցերի, ինչպես նաև իրականացնում են Օգտատերերի պատվերների հաստատումը։
        </S.TermsListPoint>
        <S.TermsListPoint>2.15. <b>Գրանցում՝</b> ընթացակարգ, որի ընթացքում Օգտատերը լիովին և անվերապահորեն ընդունում է ԸԴՊ-ն, Կայք մուտք գործելով, սահմանված կարգով ներկայացնում է հավաստի տվյալներ իր մասին և գրանցումն ավարտելով համարվում է ստորագրած Պայմանագիրը: Գրանցումը համարվում է ավարտված միայն Օգտատիրոջ կողմից գրանցման բոլոր փուլերը հաջողությամբ անցնելուց հետո, ներառյալ ակտիվացումը, որն իրականացվում է հղում ուղարկելով Օգտատիրոջ նշած էլեկտրոնային փոստի հասցեին կամ բջջային հեռախոսահամարին: Օգտատիրոջ կողմից այդ հղումի ստացումը հանդիսանում է Կայքի կողմից Օգտատիրոջը գրանցելու համաձայնություն: Օգտատիրոջ գրանցումը համարվում է ավարտված և պայմանագիրը կնքված, երբ Օգտատերը կատարում է անցում նշված հղումով:
        </S.TermsListPoint>
        <S.TermsListPoint>2.16. <b>Նույնականացման տվյալներ՝</b> Օգտատիրոջ անունը, ազգանունը, ծննդյան տարին, ամիսը և ամսաթիվը, անձը հաստատող փաստաթղթի տվյալները, իրավաբանական անձի տվյալները, Գաղտնաբառը (եթե առկա է) և այլ տվյալներ, որոնք օգտագործվում են առանձին կամ միասին` համաձայն Կայքի իրավատիրոջ կողմից սահմանված կարգի։
        </S.TermsListPoint>
        <S.TermsListPoint>2.17. <b>Անձնական էջ՝</b> Կայքի միջոցով առանձնացված տիրույթ, որի միջոցով Օգտատերը կարողանում է մուտք գործել Կայք, գնել ապրանքներ, տալ անհատական առաջադրանքով պատվերներ և կատարել ԸԴՊ-ով սահմանված այլ գործողություններ։</S.TermsListPoint>
        <S.TermsListPoint>2.18. <b>Կայքում գրանցման, անձնական էջի կառավարման և պատվերների ստեղծման ուղեցույց (կամ՝ ուղեցույց)՝</b> ձեռնարկ, որը պարունակում է այցելուների գրանցման գործընթացի, պատվերների ստեղծման, անձնական էջի կառավարման և պատվերների հաստատման գործողությունների հաջորդականության և իրականացման մանրամասն նկարագրություն։
        </S.TermsListPoint>
        <S.TermsListPoint>2.19. <b>Լրացուցիչ համաձայնագիր՝</b> առանձին օգտատերերի հետ կնքվող գրավոր փաստաթուղթ, որում կարող են սահմանվել այլ պայմաններ, քան նախատեսված է Պայմանագրում և ԸԴՊ-ում։</S.TermsListPoint>
        <S.TermsListPoint>2.20. <b>Աշխատանքային օր՝</b> երկուշաբթիից շաբաթ օրերը ներառյալ, բացառությամբ ՀՀ օրենսդրությամբ և իրավական ակտերով սահմանված ոչ աշխատանքային օրերի։
        </S.TermsListPoint>
        <S.TermsListPoint>2.21. <b>Աշխատանքային ժամեր՝</b> Ընկերության  աշխատանքային ժամերը՝ երկուշաբթիից ուրբաթ  ժամը՝ 09։00-18։00-ը , շաբաթ՝ ժամը՝ 09։00-13։00-ը։</S.TermsListPoint>
        </S.TermsList>
        <S.TermsSubTitle>
        3.	ԳՐԱՆՑՈՒՄԸ ԿԱՅՔՈՒՄ / ԱՆՁՆԱԿԱՆ ԷՋԻՑ ՕԳՏՎԵԼԸ
        </S.TermsSubTitle>
        

        <S.TermsList>
          <S.TermsListPoint>3.1. Կայքում գրանցումը իրականացվում է Կայք մուտք գործելու և Կայքում գրանցման համար նախատեսված հատվածում պահանջվող տեղեկատվությունը լրացնելու միջոցով։</S.TermsListPoint>
          <S.TermsListPoint>3.2. Կայքում գրանցվելու համար լրացվում են հետևյալ տվյալները</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>3.2.1. Ֆիզիկական անձի համար՝ 
            <S.TermsList>
            <S.TermsListPoint> <ArrowRight size={16} /> Անուն, ազգանուն, </S.TermsListPoint>
            <S.TermsListPoint> <ArrowRight size={16} /> ՀԾՀ (հանրային ծառայության համարանիշ) կամ անձը հաստատող փաստաթղթի համար, </S.TermsListPoint>
            <S.TermsListPoint> <ArrowRight size={16} /> Հեռախոսահամար,  </S.TermsListPoint>
            <S.TermsListPoint> <ArrowRight size={16} /> Էլեկտրոնային փոստի հասցե։</S.TermsListPoint>
            </S.TermsList>
            </S.TermsListPoint>
          <S.TermsListPoint style={{ paddingLeft: '20px' }}>3.2.2. Իրավաբանական անձի համար՝ 
          <S.TermsList>
          <S.TermsListPoint> <ArrowRight size={16} /> Գրանցված ֆիրմային անունը, </S.TermsListPoint>
          <S.TermsListPoint> <ArrowRight size={16} />  ՀՎՀՀ, </S.TermsListPoint>
          <S.TermsListPoint> <ArrowRight size={16} />  Հեռախոսահամար,</S.TermsListPoint>
          <S.TermsListPoint> <ArrowRight size={16} />   Էլեկտրոնային փոստի հասցե։</S.TermsListPoint>
          </S.TermsList></S.TermsListPoint>
          <S.TermsListPoint>3.3. Կայքում գրանցման համար անհրաժեշտ տեղեկատվությունը լրացնելուց հետո անձի կողմից նշած էլեկտրոնային փոստի հասցեին կամ բջջային հեռախոսին մինչև 3 (երեք) աշխատանքային օրվա ընթացքում գալիս է համապատասխան հավաստում՝ կայքում գրանցված լինելու մասին։</S.TermsListPoint>
          <S.TermsListPoint>3.4. Իրավաբանական անձի կողմից կայքում գրանցվելիս Կայքի ադմինի կողմից իրավաբանական անձի՝ գրանցման մեջ նշված էլեկտրոնային փոստին նամակներ ուղարկելու միջոցով կարող են պահանջվել լրացուցիչ փաստաթղթեր՝ իրավաբանական անձի նույնականացման և Կայքում օգտատիրոջ գրանցումը հաստատելու համար։</S.TermsListPoint>
          <S.TermsListPoint>3.5. Կայքի գրանցումը հաջողած անձը Կայքի կողմից ուղարկվող հղումով անցելիս պետք է գնա մուտքի էջ, լրացնի իր անձնական էջի գաղտնաբառը։ Գաղտնաբառը պետք է պարունակի առնվազն 6 նիշ՝ ներառյալ, թիվ, տառ ու նշան (սիմվոլ)։ Գաղտնաբառը լրացնելուց հետո Օգտատերը արդեն իսկ մուտք է գործում իր անձնական էջ։</S.TermsListPoint>
          <S.TermsListPoint>3.6. Օգտատիրոջ կողմից իր գաղտնաբառի կորստի դեպքում, գաղտնաբառն ուղարկվում է այն էլեկտրոնային փոստի հասցեին, որով Օգտատերը գրանցվել է Կայքում:</S.TermsListPoint>
          <S.TermsListPoint>3.7. Կայքում գրանցվելու և Կայքից օգտվելու հասանելիություն ունենալու համար սահմանվում են հետևյալ տեխնիկական պահանջները.  </S.TermsListPoint>
          <S.TermsList>
            <li>Ժամանակակից բրաուզեր (Կայքն աշխատում է ինչպես համակարգիչներով, այնպես էլ մոբայլ (բջջային շարժական կապի հնարավորությամբ) տարբերակով),</li>
            <li>Ինտերնետի (համացանցի) առկայություն, </li>
            <li>Գործող հեռախոսահամար և էլեկտրոնային փոստի հասցե։</li>
          </S.TermsList>
         
          <S.TermsListPoint>3.8. Օգտատերը երաշխավորում է, որ տրամադրված անձնական տվյալները իրական են, չեն խախտում այլ անձանց իրավունքներն ու օրինական շահերը։</S.TermsListPoint>
          <S.TermsListPoint>3.9. Օգտատիրոջ կողմից կեղծ կամ ոչ հավաստի անձնական տվյալներ տրամադրելու կամ դրանցով այլ անձանց անձնական տվյալները խախտելու դեպքում դրա պատասխանատվությունն ամբողջությամբ կրում է այդպիսի տվյալներ տրամադրած կամ մուտքագրած անձը:</S.TermsListPoint>
          <S.TermsListPoint>3.10. Իր տվյալների գաղտնիությունն ապահովելու նպատակով Օգտատերն իր վրա է վերցնում երրորդ անձի հասանելիությունից Կայքի իր մուտքանունն ու գաղտնաբառը պահպանելու ու երրորդ անձին գիտակցաբար այն չտրամադրելու պատասխանատվությունը, ինչպես նաև Կայքի օգնությամբ գաղտնաբառը ժամանակին փոխելու պատասխանատվությունը՝ դրա կորստի կամ այլ անհրաժեշտությունից բխող դեպքերում: Օգտատիրոջ կողմից իր գաղտնաբառի և մուտքանունի կորստի համար, այն երրորդ անձանց հասանելի լինելու և դրանից բխող բոլոր հետևանքների և կրած վնասերի համար պատասխանատու է բացառապես Օգտատերը:</S.TermsListPoint>
          <S.TermsListPoint>3.11. Օգտատերը համաձայն է, որ Կայքի Ադմինիստրացիան իրավունք ունի սեփական հայեցողությամբ և առանց հատուկ ծանուցման կամ նախազգուշացման սահմանափակելու Օգտատիրոջ մուտքը Կայք՝ Պայմանագրի և ԸԴՊ-ի պահանջները խախտելու դեպքում:</S.TermsListPoint>
          <S.TermsListPoint>3.12. Գրանցվելով Կայքում և օգտվելով Կայքի ծառայություններից՝ Օգտատերը հաստատում է իր համաձայնությունն առ այն, որ նա օգտվում է Կայքից և դրա ծառայություններից ըստ իր կամքի և պատասխանատվության, գրանցվում և վերցնում է իր վրա բոլոր ռիսկերը, որոնք վերաբերում են անհատական պատվերների ստեղծմանը, հաստատմանը և դրանց համար վճարելուն։</S.TermsListPoint>
        </S.TermsList>

        <S.TermsSubTitle>4. ՊԱՏՎԵՐՆԵՐԻ ՍՏԵՂԾՈՒՄ / ՁԵՎԱՎՈՐՈՒՄԸ ԵՎ ՀԱՍՏԱՏՈՒՄԸ</S.TermsSubTitle>
        <S.TermsList>
          <S.TermsListPoint>4.1. Կայքում գրանցված անձը Կայքի միջոցով կատարում է արդեն իսկ Կայքում ցուցադրված առկա ապրանքների պատվերներ կամ անձնական էջի միջոցով ստեղծում իր անհատական առաջադրանքով պատվերը։</S.TermsListPoint>
          <S.TermsListPoint>4.2. Անձնական էջ մուտք գործելով օգտատերը կարող է ինքնուրույն ստեղծել/ ձևավորել իր պատվերը, որը հնարավորություն կտա համապատասխան գործիքակազմի միջոցով ստանալ անհատական պատվերի վերջնական տեսքը՝ ընտրելով նյութերը, դրանց կտրման երկարությունը, լայնությունը, քանակը և անհրաժեշտ այլ պարամետրերը։</S.TermsListPoint>
          <S.TermsListPoint>4.3. Անհատական առաջադրանքով պատվերի ստեղծման և ձևավորման համար Օգտատերը կարող է օօգտվել «Կայքում գրանցման, անձնական էջի կառավարման և պատվերների ստեղծման» ուղեցույցից։</S.TermsListPoint>
          <S.TermsListPoint>4.4. Անձնական էջում «Ավելացնել Պատվեր» կոճակը սեղմելիս Օգտատերը կարող է ինքնուրույն ստեղծել/ ձևավորել իր պատվերը՝ ընտրելով նյութը, ձևման պարամետրերը (կտրման համար մուտքագրի երկարություն, լայնություն, քանակ և եզրաշերտման տեսակ և կողմեր):</S.TermsListPoint>
          <S.TermsListPoint>4.5. Անձնական էջում արդեն իսկ ձևավորված պատվերի բոլոր մանրամասներին ծանոթանալու համար Օգտատերը վերադառնում է «Պատվերի ձևման» էջ, հավաստիանում, որ նյութերը, դրանց կտրման երկարությունը, լայնությունը, քանակը և անհրաժեշտ այլ պարամետրերը ճիշտ են ընտրված և սեղմում է «Պահպանել և ձևել» կոճակը, որի արդյունքում ստեղծվում է պատվերի ձևման քարտեզ։</S.TermsListPoint>
          <S.TermsListPoint>4.6. Պատվերի ձևման քարտեզը Օգտատերը կարող է տեսնել «Ձևման արդյունք» հարթակում, որտեղ բացի քարտեզից ցուցադրված է ավելացված նյութերը, այդպիսիք լինելու դեպքում։</S.TermsListPoint>
          <S.TermsListPoint>4.7. «Պատվերի գնացուցակ» հարթակում, Օգատերը արդեն իսկ կարող է տեսնել ձևման քարտեզի հիման վրա պատվերի վրա ծախսվող նյութերի և կատարվող աշխատանքների արժեքները՝ առանձին։</S.TermsListPoint>
          <S.TermsListPoint>4.8. Օգտատիրոջ կողմից պատվերը վերջնական ձևավորելուց հետո, վերջինիս ուղարկվում է պատվերի գնացուցակը, որը ներառում է նյութեր և աշխատանքների կատարման ծախսերը։</S.TermsListPoint>
          <S.TermsListPoint>4.9. Օգտատիրոջ կողմից պատվերի գնացուցակին և ձևման արդյունքներին ծանոթանալուց հետո Օգտատերը սեղմելով «Ուղարկել ստուգման» կոճակը պատվերն ուղարկում է ստուգման՝ Կայքի ադմինի կողմից վերջնական հաստատման համար։</S.TermsListPoint>
          <S.TermsListPoint>4.10. Կայքի ադմինի կողմից պատվերը հաստատվելուց հետո Օգտատիրոջ էլեկտրոնային փոստի հասցեին ուղարկվում է տեղեկատվություն պատվերի հաստատման կամ չհաստատվելու մասին։</S.TermsListPoint>
          <S.TermsListPoint>4.11. Կայքի ադմինի կողմից պատվերի հաստատման համար ստուգումն իրականացվում է 1 (մեկ) աշխատանքային օրվա ընթացքում։</S.TermsListPoint>
          <S.TermsListPoint>4.12. Պատվերը չհաստատվելու դեպքում Օգտատիրոջը ուղարկվում է չհաստատման պատճառները և առաջարկում այլ նյութերով պատվերի ձևավորում։</S.TermsListPoint>
          <S.TermsListPoint>4.13. Պատվերը հաստատվելու դեպքում Օգտատիրոջ էլեկտրոնային փոստին ուղարկվում է հաղորդագրություն։</S.TermsListPoint>
          <S.TermsListPoint>4.14. Կայքի ադմինի կողմից պատվերը հաստատվելուց հետո անձնական էջում ավելանում է պատվերի համար վճարելու հնարավորությունը։</S.TermsListPoint>
          <S.TermsListPoint>4.15. Ձևավորաված պատվերը հաստատելու համար Օգտատերը կարող է օգտվել «Կայքում գրանցման, անձնական էջի կառավարման և պատվերների ստեղծման ուղեցույցից։</S.TermsListPoint>
          <S.TermsListPoint>4.16. Ընկերության կողմից անհատական առաջադրանքով պատվերի վրա աշխատանքները սկսվում են Օգտատիրոջ կողմից պատվերի համար ամբողջական վճարումը Ընկերության կողմից ստանալու պահից։</S.TermsListPoint>
        </S.TermsList>
        <S.TermsTitle>Terms and Conditions</S.TermsTitle>
        <S.TermsSubTitle>5. ԱՊՐԱՆՔԻ ՀԱՄԱՐ ՎՃԱՐՄԱՆ ԿԱՐԳԸ ԵՎ ՊԱՅՄԱՆՆԵՐԸ</S.TermsSubTitle>
        <S.TermsList>
          <S.TermsListPoint>5.1. Օգտատիրոջ կողմից իր անձնական էջում «Վերջնական հաստատում» կոճակը սեղմելուց հետո բացվում է «Վճարել պատվերի համար» կոճակը, որով Օգտատերը պետք է կատարի ապրանքի համար ամբողջական վճարումը՝ սույն կանոններով սահմանված կարգով։</S.TermsListPoint>
          <S.TermsListPoint>5.2. Ապրանքի համար վճարվող գումարը գոյանում ըստ անձնական էջում Օգտատիրոջն արդեն իսկ ներկայացված պատվերի գնացուցակի և ներառում է պատրաստման համար անհրաժեշտ նյութերը և աշխատանքների կատարման ծախսերը։</S.TermsListPoint>
          <S.TermsListPoint>5.3. Օգտատերը վճարումը կատարում է անկանխիկ՝ Ընկերության կողմից Կայքում տեղադրված բանկային հաշվեհամարին փոխանցում կատարելու կամ VPOS համակարգի միջոցով։</S.TermsListPoint>
          <S.TermsListPoint>5.4. Օգտատիրոջ կողմից իր անձնական էջում «Վերջնական հաստատում» կոճակը սեղմելուց հետո պատվերի համար վճարումը 3 (երեք) աշխատանքային օրվա ընթացքում չկատարելու դեպքում Կայքի ադմինն իրավունք ունի չեղարկել պատվերը և այն հեռացնել Օգտատիորջ անձնական էջից։</S.TermsListPoint>
          <S.TermsListPoint>5.5. Ընկերության կողմից անհատական պատվերի վրա աշխատանքները սկսվում են Օգտատիրոջ կողմից պատվերի համար ամբողջական վճարումը ստանալու պահից։</S.TermsListPoint>
          <S.TermsListPoint>5.6. Պատվերի համար վճարումը ստանալուց հետո Ընկերությունն Օգտատիրոջ անձնական էջի ծանուցում բաժնի միջոցով Օգտատիրոջ էլեկտրոնային փոստի հասցեին ուղարկում է պատվերի հաստատման ծանուցում՝ վճարման հաշվի հետ միասին։</S.TermsListPoint>
          <S.TermsListPoint>5.7. Պատվերները պատրաստվում եմ մինչև 10 (տասը) աշխատանքային օրվա ընթացքում, եթե այլ բան նախատեսված չէ կողմերի միջև էլեկտրոնային փոստի նամակագրությամբ կամ լրացուցիչ համաձայնագրով։</S.TermsListPoint>
          <S.TermsListPoint>5.8. Պատվերը պատրաստ լինելու դեպքում, դրա վերաբերյալ ծանուցումն ուղարկվում է օգտատիրոջը Անձնական էջի ծանուցումների բաժնով կամ էլեկտրոնային փոստով և առաջարկվում է ընտրել ապրանքի ստացման տարբերակը՝ վերցնել Ընկերության պահեստից կամ ստանալ առաքմամբ։</S.TermsListPoint>
        </S.TermsList>
        <S.TermsSubTitle>6. ԱՊՐԱՆՔԻ ՀԱՆՁՆՈՒՄԸ</S.TermsSubTitle>
        <S.TermsList>
          <S.TermsListPoint>6.1. Օգտատերը կամ վերջինիս կողմից նշված անձը պատրաստված ապրանքը իր միջոցներով կարող է վերցնել Ընկերության պահեստից (հասցե՝ ՀՀ, ք․ Երևան, Թևոսյան 13/11) կամ ստանալ առաքմամբ։</S.TermsListPoint>
          <S.TermsListPoint>6.2. Ընկերության պահեստից ապրանքը վերցնելու համար Օգտատերը կամ վերջինիս կողմից նշված անձը ապրանքը կարող է ստանալ միայն Պատվերի հաստատման մասին Ընկերության կողմից Օգատիրոջն ուղարկված փաստաթղթով։</S.TermsListPoint>
          <S.TermsListPoint>6.3. Օգտատերը Ընկերության պահեստից ապրանքները կարող է վերցնել դրանք պատրաստ լինելու մասին ծանուցումը Ընկերության կողմից ուղարկվելուց հետո մինչև 3 (երեք) աշխատանքային օրվա ընթացքում՝ երկուշաբթիից ուրբաթ, ժամը՝ 09։0-18։00-ը ընկած ժամանակահատվածում՝ ներկայանալով Ընկերության պահեստի հասցեով։</S.TermsListPoint>
          <S.TermsListPoint>6.4. Օգտատերը կամ վերջինիս կողմից նշված անձի կողմից Ընկերության պահեստից ապրանքը դուրս հանելուց հետո վերջիններս ամբողջապես կրում են այդ ապրանքի պատահական կորստի կամ վնասվածքի ռիսկը։</S.TermsListPoint>
          <S.TermsListPoint>6.5. Ապրանքների առաքում պատվիրելու դեպքում առաքումն իրականացվելու է Ընկերության կամ առաքման ծառայություններ իրականացնողների միջոցով, որոնց ընտրում է Օգտատերը՝ իր պատասխանատվությամբ։</S.TermsListPoint>
          <S.TermsListPoint>6.6. Ապրանքների առաքումն իրականացվում է ապրանքը պատրաստ լինելու մասին ծանուցումը Ընկերության կողմից ուղարկվելուց հետո 4-5 աշխատանքային օրվա ընթացքում։</S.TermsListPoint>
          <S.TermsListPoint>6.7. Առաքումն իրականացնում է Օգտատիրոջ կողմից նշված հասցեով՝ նախապես կապ հաստատելով Օգտատիրոջ կողմից տրամադրած հեռախոսահամարով։ Ապրանքը հանձնվում է օգտատիրոջ կողմից նշված անձին։</S.TermsListPoint>
          <S.TermsListPoint>6.8. Օգտատերը պարտավոր է ապահովել տրամադրված հեռախոսահամարի հասանելիությունը:</S.TermsListPoint>
          <S.TermsListPoint>6.9. Օգտատերը պատասխանատու է առաքման հասցեի ճշգրտության և հստակության համար: Ոչ ճշգրիտ կամ թերի հասցեների ներկայացման կամ պայմանավորված առաքման ժամին ապրանքը չընդունելու դեպքում Ընկերությունը պատասխանատվություն չի կրում առաքման ուշացման, ապրանքների կորստի կամ այլ խնդիրներ համար:</S.TermsListPoint>
          <S.TermsListPoint>6.10. Օգտատերը կամ վերջինսի կողմից նշված առաքումը ստացող անձը պարտավոր է առաքման պահին ստուգել ապարանքների համապատասխանությունը ներկայացված պահանջներին, ներառյալ՝</S.TermsListPoint>
          <S.TermsList>
            <S.TermsListPoint>6.11. Քանակը,</S.TermsListPoint>
            <S.TermsListPoint>6.12. Տեսքը,</S.TermsListPoint>
            <S.TermsListPoint>6.13. Պատշաճ որակը և տեխնիկական բնութագրերը</S.TermsListPoint>
            <S.TermsListPoint>6.14. Անհատական առաջադրանքով պատվերի նկարագրին համապատասխանությունը։</S.TermsListPoint>
          </S.TermsList>
          <S.TermsListPoint>6.15. Օգտատերը կամ վերջինսի կողմից առաքումը ստացող անձը առաքման պահին չի ստուգում ապրանքը կամ ստուգելուց հետո սույն կանոններով սահմանված կարգով Ընկերությանը չի ներկայացնում որևէ առարկություն կատարված աշխատանքի համար, ապա ապրանքը համարվում է պատշաճ որակի, իսկ աշխատանքը՝ պատշաճ կատարված։</S.TermsListPoint>
          <S.TermsListPoint>6.16. Եթե առաքման պահին Օգտատիրոջ կողմից հայտաբերվում է որևէ անհամապատասխանություն, ապա այդ Օգտատերն անմիջապես պարտավոր է տեղեկացնել առաքումն իրականացնող անձին, ինչպես նաև Ընկերությանը՝ էլեկտրոնային փոստի հասցեով՝ գրավոր ներկայացնելով առաքման պահին հայտնաբերված թերությունների և/կամ անհամապատասխանության մասին բողոք/տեղեկացում։</S.TermsListPoint>
          <S.TermsListPoint>6.17. Ընկերությունը պատասխանատվություն չի կրում ապրանքի որակի կամ քանակի հետ կապված բողոքների համար, ինչպես նաև Օգտատիրոջը չի վերադարձվում ապրանքի և առաքման համար վճարված գումարը, եթե Օգտատիրոջ կողմից համապատասխան բողոքը ներկայացվել է առաքումն իրականացնելուց հետո 3 (երեք) աշխատանքային օր անց։</S.TermsListPoint>
          <S.TermsListPoint>6.18. Ընկերությունը պատասխանատվություն չի կրում ապրանքի որակի կամ քանակի հետ կապված այն բողոքների համար, որոնք առաջացել են առաքման ծառայություններ իրականացնողների միջոցով ապրանքը Օգտատիրոջը փոխանցելու/տեղափոխոլու ընթացքում։ Ապրանքի առաքումը ընկերության փոխարեն այլ առաքում իրականացնողի ընտրելիս Օգտատերը ընդունում և առաջնորդվում է տվյալ առաքում իրականացնողի պայմաններով, որոնց համար Ընկերությունը պատասխանատվություն չի կրում։</S.TermsListPoint>
          <S.TermsListPoint>6.19. Եթե Օգտատիրոջ մեղքով 3 (երեք) օր անընդմեջ հնարավոր չի եղել առաքել ապրանքը կամ ապրանքը պատրաստ լինելու մասին ծանուցումը Ընկերության կողմից ուղարկվելուց հետո 3 (երեք) աշխատանքային օրվա ընթացքում Օգտատերն չի վերցրել ապրանքը Ընկերության պահեստից, ապա Ընկերությունը ապրանքը վերցնում է պատասխանատու պահպանության առավելագույնը 60 (վաթսուն) օր ժամկետով։</S.TermsListPoint>
          <S.TermsListPoint>6.20. Պատասխանատու պահպանության վերցված ապրանքը Օգտատիրոջը առաքվելու կամ վերջինս կողմից այն ստանալու դեպքում, Օգտատերը պարտավոր է հատուցել ապրանքի պահպանության համար կատարած Ընկերության ծախսերը՝ ապրանքի պահպանության յուրաքանչյուր օրվա համար վճարելով ապրանքի գնի 1%-ին (մեկ տոկոսի) համարժեք ՀՀ դրամ։</S.TermsListPoint>
          <S.TermsListPoint>6.21. Ապրանքը պատասխանատու պահպանության վերցնելու և պահպանության համար նախատեսված ծախսերի մասին Օգտատերը ծանուցվում է էլեկտրոնային փոստի հասցեով։</S.TermsListPoint>
        </S.TermsList>
        <S.TermsSubTitle>7. ԱՇԽԱՏԱՆՔԻ ՈՐԱԿԻ ԵՐԱՇԽԻՔ</S.TermsSubTitle>
        <S.TermsList>
          <S.TermsListPoint>7.1. Ընկերությունն ապահովում է օգտատիրոջն առաքված ապրանքի վրա կատարված աշխատանքի համար 1 տարվա երաշխիք (երաշխիքային ժամկետ), որը հաշվարկվում է Օգտատիրոջ կողմից ապրանքը ստանալու պահից։</S.TermsListPoint>
          <S.TermsListPoint>7.2. Երաշխիքային ժամկետի ընթացքում Ընկերությունը պարտավոր է անվճար վերացնել առաքված ապրանքի թերությունները կամ փոխարինել համարժեք նորով, բացառությամբ հետևյալ դեպքերի․</S.TermsListPoint>
          <S.TermsList>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>7.2.1. Ապրանքը ենթարկվել է արտաքին ներգործության, որը չի համապատասխանում դրա բնական օգտագործման պայմաններին (ներառյալ՝ մեխանիկական վնասվածքներ, քիմիական ներգործություն, սխալ տեղադրում և օգտագործում և այլն),</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>7.2.2. Ապրանքն օգտագործվել է ոչ իր նպատակային նշանակությամբ, ինչպես նաև եթե ապրանքը օգտագործվել է ոչ պատշաճ կերպով (օրինակ՝ վերամշակման, տաքացման կամ խիստ ջերմաստիճաններում օգտագործման արդյունքում),</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>7.2.3. Ապրանքի դեֆեկտն (ֆիզիկական թերությունը) առաջացել է այն ոչ պատշաճ տեղադրելու կամ օգտագործելու սխալ պայմաններում (օրինակ՝ անպիտան հիդրոստատիկ պայմաններում կամ այլ անհամապատասխան միջավայրում ապրանքը տևական ժամանակ պահելու արդյունքում),</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>7.2.4. Անձի կողմից խախտվել են ապրանքի օգտագործման հրահանգները և կանոնները։</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>7.2.5. Ապրանքի վնասվածքը կամ դեֆեկտը առաջացել է երրորդ կողմի գործողությունների և/կամ ֆորս-մաժորային հանգամանքների հետևանքով (ներառյալ՝ ջրհեղեղ, հրդեհ, երկրաշարժ և այլն)։</S.TermsListPoint>
          </S.TermsList>
          <S.TermsListPoint>7.3. Օգտատերը պարտավոր է աշխատանքի թերությունների հայտնաբերման դեպքում երաշխիքային ժամկետում Ընկերությանը էլեկտրոնային եղանակով ներկայացնել երաշխիքի պահանջ՝ միաժամանակ ներկայացնելով պատվերի ստանալը հավաստող փաստաթուղթը։</S.TermsListPoint>
        </S.TermsList>
        <S.TermsSubTitle>8. ԿՈՂՄԵՐԻ ԻՐԱՎՈՒՆՔՆԵՐՆ ՈՒ ՊԱՐՏԱԿԱՆՈՒԹՅՈՒՆՆԵՐԸ</S.TermsSubTitle>
        <S.TermsList>
          <S.TermsListPoint>8.1. Կայքի իրավատերն / Ընկերությունն իրավունք ունի՝</S.TermsListPoint>
          <S.TermsList>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.1.1. Հետևել Կայքում ծառայություններից օգտվելու ընթացքում Օգտատիրոջ գործողություններին և կանխել Պայմանագրի և ԸԴՊ-ի դրույթները խախտող ցանկացած գործողություն:</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.1.2. Ցանկացած ժամանակ փոփոխել և/կամ լրացնել Պայմանագիրը և ԸԴՊ-ն, ինչպես նաև դրան կից հավելվածները, Կայքի ձևավորումը, բովանդակությունը, առաջարկվող ծառայությունների ցանկը, բովանդակությունը, ծրագրային ապահովումը, սպասարկման հավելվածները և Կայքում գործածվող կամ պահպանվող այլ օբյեկտները՝ այդ մասին Օգտատիրոջը Կայքում կամ անձնական էջում ծանուցելով։</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.1.3. Իրականացնել պրոֆիլակտիկ աշխատանքներ Կայքի սերվերի վրա, որի համար ժամանակավորապես դադարեցնել մուտքը Կայք՝ չխախտելով Կայքի բնականոն ընթացքը: Պրոֆիլակտիկ աշխատանքների մասին Ընկերությունը ծանուցում է Կայքից բոլոր օգտվողներին՝ Կայքում այդպիսի տեղեկատվության տեղադրման միջոցով:</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.1.4. Օգտատիրոջ կողմից ԸԴՊ-ով սահմանված պահանջները խախտելու դեպքում կասեցնել կամ արգելափակել տվյալ Օգտատիրոջ հասանելիությունը Կայք՝ մինչև այդպիսի խախտման վերացումը, այդ մասին տեղեկացնելով Օգտատիրոջը: Օգտատիրոջ կողմից ծանուցումն ստանալու օրվանից 3 (երեք) օրվա ընթացքում թույլ տված խախտումը չվերացնելու դեպքում Ընկերությունն իրավունք ունի առանց ծանուցման կամ նախազգուշացման միակողմանի լուծել սույն Պայմանագիրը: Ընկերությունը որևէ կերպով պատասխանատվություն չի կրում սույն Պայմանագրի լուծման և/կամ Կայքի հասանելիության կասեցման կամ արգելափակման հետ կապված Օգտատիրոջ կրած վնասների համար:</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.1.5. Օգտատիրոջ համար կարևոր տեղեկատվությունը պահպանելու նպատակով ստեղծել տվյալների պահուստային պատճեններ՝ դրանք հետագայում վերականգնելու հնարավորությամբ:</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.1.6. Խոտանել կամ իր հայեցողությամբ ցանկացած այլ ձևեվ տնօրինել ավելի քան 60 օր պատասխանատու պահպանության վերցված ապրանքը, եթե Օգտատերը հրաժարվել է ապրանքից կամ Պայմանագրով սահմանաված որևէ եղականով հնարավոր չի եղել այն հանձնել Օգտատիրոջը։</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.1.7. Առաջարկել Օգտատիրոջը՝ անհատական առաջադրանքով պատվեր ստեղծելիս օգտվել այլ նյութերից և տալ այլ պարամետրեր, եթե Կայքի ադմինի կողմից Օգտատիրոջ կողմից ստուգման ուղարկված պատվերը չի հաստատվել։</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.1.8. Օգտատիրոջ գործողություններում հանցագործության հատկանիշներ հայտնաբերելու պարագայում՝ առանց օգտատիրոջը ծանուցելու դիմել իրավապահ մարմիններին։</S.TermsListPoint>
          </S.TermsList>
          <S.TermsListPoint>8.2. Կայքի իրավատերը / Ընկերությունը պարտավոր է՝</S.TermsListPoint>
          <S.TermsList>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.2.1. Պատշաճ և որակով կատարել Կայքով պատվերների աշխատանքները։</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.2.2. Հետևել Կայքի անխափան աշխատանքին (անխափան աշխատանք է համարվում, եթե կայքի հասանելիության ընդհատումը կամ խափանումը չի գերազանցում 5 (հինգ) անըդնմեջ աշխատանքային օրը):</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.2.3. Օգտատիրոջը տրամադրել Կայքից օգտվելու հասանելիություն՝ ըստ սույն ԸԴՊ-ի։</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.2.4. Ապահովել ապարանքների երաշխիքային սպասարկումը՝ Ըստ ԸԴՊ-ի։</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.2.5. Ապրանքների առաքումն իրականացնել սահմանված ժամկետում։</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.2.6. Օգտատիրոջ անձնական տվյալները մշակել ՀՀ օրենսդրությանը համաձայն։</S.TermsListPoint>
          </S.TermsList>
          <S.TermsListPoint>8.3. Օգտատերն իրավունք ունի՝</S.TermsListPoint>
          <S.TermsList>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.3.1. Օգտվելու Անձնական էջի բոլոր հնարավորություններից։</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.3.2. Ինքնուրույն որոշել անհատական պատվերների ձևը, քանակը և այլ պարամետրերը։</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.3.3. Կայքի իրավատիրոջը սույն ԸԴՊ-ով սահմանված կարգով ներկայացնել մեկնաբանություններ, առաջարկություններ և բողոքներ։</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.3.4. Ստանալ իր առաքումը՝ Ըստ Պայմանագրի և ԸԴՊ-ի։</S.TermsListPoint>
          </S.TermsList>
          <S.TermsListPoint>8.4. Օգտատերը պարտավոր է՝</S.TermsListPoint>
          <S.TermsList>
          <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.4.1. Կայքից օգտվել բացառապես Կայքում սահմանված ծառայությունների շրջանակում՝ չխախտելով այլ Օգտատերերի և երրորդ անձանց իրավունքները և Կայքի անխափան աշխատանքը։</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.4.2. Չփոխանցել երրորդ անձանց իր անձնական էջի մուտքանունը և գաղտնաբառը:</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.4.3. Կայքին տրամադրել իր մասին ամբողջական, հավաստի և արդիական տեղեկատվություն, պահպանել տվյալ տեղեկատվության արդիականությունը և ամբողջականությունը, ինպես նաև չներկայանալ որպես այլ անձ և մոլորության մեջ գցել Կայքին կամ Ընկերությանը: Իսկ նման դեպք առաջանալու պարագայում անձամբ կրել այդպիսի խախտման բացասական հետևանքները։</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.4.4. Չհրապարակել Պայմանագրի շրջանակներում իրեն հայտնի դարձած ցանկացած առևտրային գաղտնիք համարվող տեղեկատվություն:</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.4.5. Չձեռնարկել այնպիսի գործողություններ, որոնք կարող են դիտվել որպես ՀՀ օրենսդրության կամ միջազգային նորմերի խախտում, կարող են վնաս հասցնել այլ անձանց կյանքին, բարի համբավին, շահերին, կազմակերպությանը և մյուս օգտատերերին, Կայքի բնականոն աշխատանքին, ինչպես նաև չձեռնարկել այնպիսի գործողություններ, որոնք հանգեցնում են կամ կարող են հանգեցնել Կայքի և Ընկերության ծառայությունների բնականոն աշխատանքի խաթարմանը:</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.4.6. Կայքից դուրս չհավաքագրել և չպահպանել այլ Օգտատերերի մասին տեղեկություններ:</S.TermsListPoint>
            <S.TermsListPoint style={{ paddingLeft: '20px' }}>8.4.7. Որևէ կերպ խոչընդոտել Կայքի բնականոն աշխատանքին, այդ թվում` բեռնել, պահպանել, փոխանցել կամ տեղադրել նյութեր, որոնք պարունակում են.
              <S.TermsList>
                <S.TermsListPoint>վիրուսներ, այլ համակարգչային կոդեր, ֆայլեր և ծրագրեր՝ նախատեսված համակարգչային կամ հեռահաղորդակցման սարքերի խափանման, ոչնչացման, կամ գործունեության սահմանափակման համար,</S.TermsListPoint>
                <S.TermsListPoint>ծրագրեր՝ նախատեսված չարտոնված մուտքեր կատարելու համար,</S.TermsListPoint>
                <S.TermsListPoint>կոմերցիոն ծրագրային արտադրանքների սերիական համարներ և դրանց գեներացման ծրագրեր,</S.TermsListPoint>
                <S.TermsListPoint>լոգիններ, գաղտնաբառեր և այլ միջոցներ՝ Կայքի վճարովի ծառայություններին չարտոնված մուտք ստանալու համար,</S.TermsListPoint>
                <S.TermsListPoint>վերը թվարկված տեղեկատվությանը վերաբերող հղումներ:</S.TermsListPoint>
              </S.TermsList>
            </S.TermsListPoint>
          </S.TermsList>
        </S.TermsList>
        <S.TermsSubTitle>9. ԿՈՂՄԵՐԻ ՊԱՏԱՍԽԱՆԱՏՎՈՒԹՅՈՒՆԸ</S.TermsSubTitle>
        <S.TermsList>
          <S.TermsListPoint>9.1. Կայքում տեղադրված բոլոր տեղեկություններն ու նյութերը հանդիսանում են Կայքի բացառիկ սեփականությունը և պաշտպանված են ՀՀ օրենսդրությամբ և միջազգային իրավունքի նորմերով։ Կայքում տեղադրված տեղեկություններն ու նյութերը(ամբողջությամբ կամ դրանց մասերը) չեն կարող օգտագործվել որևէ ձևով՝ վերարտադրվել (այդ թվում պատճենահանման միջոցով), լրամշակվել, տարածվել, հրապարակվել և փոխանցվել երրորդ անձանց և/կամ որևէ այլ կերպ օգտագործվել Օգտատիրոջ կողմից, եթե առկա չէ Ընկերության նախնական գրավոր համաձայնությունը:</S.TermsListPoint>
          <S.TermsListPoint>9.2. Օգտվելով Կայքի ծառայություններից՝ Օգտատերը հաստատում է, որ կրում է ամբողջական պատասխանատվություն՝ իր տեղադրած հայտարարության բովանդակության համար, Կայքով կատարած գործողությունների համար։</S.TermsListPoint>
          <S.TermsListPoint>9.3. Եթե Կայքում անձը սխալ կոնտակտային տվյալներ է տեղադրում կամ օգտվում է այլ անվան տակ, ապա Կայքն իրավունք ունի այդ կոնտակտային տվյալները տրամադրել տուժած կողմին կամ վերջինիս ներկայացուցչին կամ իրավապահ մարմիններին՝ ՀՀ օրենսդրությամբ սահմանված կարգով։</S.TermsListPoint>
          <S.TermsListPoint>9.4. Կայքը, Կայքի իրավատերը, Կայքի աշխատակիցները ոչ մի պատասխանատվություն չեն կրում Կայքում Օգտատիրոջ կողմից անձնական էջի կառավարման ընթացքւոմ ցանկացած կորստի և վնասի համար։</S.TermsListPoint>
          <S.TermsListPoint>9.5. Ընկերությունը պատասխանատվություն չի կրում օգտատիրոջ կողմից լրացված/ տրամադրված էլեկտրոնային փոստի հասցեին ծանուցումները չստացվելու կամ չընթերցվելու համար։ Հիշյալ էլեկտրոնային փոստին ընկերության կողմից ուղարկված բոլոր ծանուցումները համարվում են պատշաճ հանձնված օգատիրոջը Ընկերության կողմից ուղարկման փաստով և ուղարկման պահին։</S.TermsListPoint>
        </S.TermsList>
        <S.TermsSubTitle>10. ԱՆՁՆԱԿԱՆ ՏՎՅԱԼՆԵՐԻ ՊԱՇՏՊԱՆՈՒԹՅՈՒՆ</S.TermsSubTitle>
        <S.TermsList>
          <S.TermsListPoint>10.1. Ստորագրելով Պայմանագիրը՝ Օգտատերը տալիս է համաձայնությունը՝ Ընկերության կողմից իր անձնական տվյալների մշակմանը, ներառյալ ազգանունը, անունը, հայրանունը, կազմակերպության տվյալները, էլեկտրոնային փոստի հասցեն, կոնտակտային հեռախոսահամարը և այլ անհրաժեշտ տեղեկատվություն։</S.TermsListPoint>
          <S.TermsListPoint>10.2. Ընկերությունը պահպանում է Օգտատիրոջ անձնական տվյալները` ՀՀ օրենսդրության պահանջներին համապատասխան։</S.TermsListPoint>
          <S.TermsListPoint>10.3. Անձնական տվյալների անվտանգությունն ապահովվում է «Անձնական տվյալների պաշտպանության մասին» ՀՀ օրենքին համապատասխան։</S.TermsListPoint>
          <S.TermsListPoint>10.4. Ընկերությունը կարող է փոխանցել Օգտատիրոջ անձնական տվյալները երրորդ անձանց հետևյալ դեպքերում․</S.TermsListPoint>
          <S.TermsList>
            <S.TermsListPoint>10.4.1. եթե Օգտատերը տվել է իր անձնական տվյալները փոխանցելու համաձայնությունը</S.TermsListPoint>
            <S.TermsListPoint>10.4.2. եթե փոխանցումն անհրաժեշտ է Օգտատիրոջը՝ Կայքի ծառայություններից օգտվելու համար,</S.TermsListPoint>
            <S.TermsListPoint>10.4.3. եթե փոխանցումը նախատեսված է ՀՀ օրենսդրությամբ և կատարվում է օրենքով սահմանված կարգով,</S.TermsListPoint>
          </S.TermsList>
          <S.TermsListPoint>10.5. Օգտատերն իրավունք ունի փոփոխելու իր կողմից ներկայացված անձնական տվյալները:</S.TermsListPoint>
          <S.TermsListPoint>10.6. Օգտատերը համաձայն է և թույլ է տալիս Ընկերությանը իր էլեկտրոնային հասցեին ուղղարկել գովազդային ու տեղեկատվական նյութեր, առաջարկներ։</S.TermsListPoint>
          <S.TermsListPoint>10.7. Կայքում գրացվելու նպատակով Կայքին տրված Օգտատիրոջ անձնական տվյալները օգտագործվելու են հետևյալ ծառայությունների մատուցման համար՝</S.TermsListPoint>
          <S.TermsList>
            <S.TermsListPoint>փոխանցել տեղեկատվություն (այդ թվում գովազդ) Օգտատիրոջը,</S.TermsListPoint>
            <S.TermsListPoint>պատասխանել Օգտատիրոջ հարցերին,</S.TermsListPoint>
            <S.TermsListPoint>հրապարակել Օգտատիրոջ արձագանքները,</S.TermsListPoint>
            <S.TermsListPoint>պահպանել հետադարձ կապ Օգտատիրոջ հետ և ուղղարկել նորություններ,։</S.TermsListPoint>
          </S.TermsList>
          <S.TermsListPoint>10.8. Ստորագրելով Պայմանագիրը՝ Օգտատերը տալիս է համաձայնություն՝ Կայքի Ադմինիստրացիայի կողմից իր անձնական տվյալների մշակմանը, մասնավորապես հետևյալ նպատակներով.</S.TermsListPoint>
          <S.TermsList>
            <S.TermsListPoint>ստանալ գովազդ,</S.TermsListPoint>
            <S.TermsListPoint>ստանալ SMS (WhatsApp) հաղորդագրություններ և հեռախոսազանգեր,</S.TermsListPoint>
            <S.TermsListPoint>ստանալ այլ ծառայություններ:</S.TermsListPoint>
          </S.TermsList>
          <S.TermsListPoint>10.9. Կայքի Ադմինիստրացիան պահպանում է Օգտատիրոջ անձնական տվյալները` ՀՀ օրենսդրության պահանջներին և իր ներքին կանոնակարգերին համապատասխան:</S.TermsListPoint>
        </S.TermsList>
        <S.TermsSubTitle>11. ԱՆՀԱՂԹԱՀԱՐԵԼԻ ՈՒԺԻ ԱԶԴԵՑՈՒԹՅՈՒՆԸ</S.TermsSubTitle>
        <S.TermsList>
          <S.TermsListPoint>11.1. Պայմանագրով պարտավորություններն ամբողջությամբ կամ մասնակիորեն չկատարելու համար Կողմերն ազատվում են պատասխանատվությունից, եթե դա եղել է անհաղթահարելի ուժի ազդեցության արդյունք, որը ծագել է Պատվերը հաստատելուց հետո և որը Կողմերը չէին կարող կանխատեսել կամ կանխարգելել։ Այդպիսի իրավիճակներ են երկրաշարժը, ջրհեղեղը, հրդեհը, համաճարակները, համավարակները, պատերազմը, ռազմական և արտակարգ դրություն հայտարարելը, քաղաքական հուզումները, գործադուլները, հաղորդակցության միջոցների աշխատանքի դադարեցումը, սաբոտաժը, պետական մարմինների ակտերը և այլն, որոնք անհնարին են դարձնում Պայմանագրով նախատեսված պարտավորությունների կատարումը։</S.TermsListPoint>
          <S.TermsListPoint>11.2. Կայքը պատասխանատվություն չի կրում Օգտատերերի մուտքի թույլտվությունների դադարեցման, ծառայությունների մատուցումն ապահովող Ծրագրային ապահովումների և սարքավորումների աշխատանքի դադարեցման, Օգտատերերի անձնական և այլ տվյալների կորստի(առանց մասնակի կամ ամբողջությամբ վերականգման հնարավորության) և Օգտատերերի անձնական էջում առկա տեղեկատվության կորստի համար, ինչպես նաև պարտավոր չէ փոխհատուցել Օգտատերերի կրած վնասները, եթե այդ ամենը տեղի է ունեցել անհաղթահարելի ուժի ազդեցության՝ չկանխատեսված արտակարգ իրավիճակների հետևանքով, որոնց դեպքում Կայքի աշխատանքային գործառույթի պատշաճ կատարումը դարձել է անհնարին։</S.TermsListPoint>
        </S.TermsList>
        <S.TermsSubTitle>12. ԿԻՐԱՌԵԼԻ ՕՐԵՆՍԴՐՈՒԹՅՈՒՆԸ/ՎԵՃԵՐԻ ԼՈՒԾՄԱՆ ԿԱՐԳԸ</S.TermsSubTitle>
        <S.TermsList>
          <S.TermsListPoint>12.1. Պայմանագիրը, ինչպես նաև դրանից բխող հարաբերությունները կարգավորվում են Հայաստանի Հանրապետության գործող օրենսդրությամբ:</S.TermsListPoint>
          <S.TermsListPoint>12.2. Կողմերի միջև ցանկացած խնդրի դեպքում կողմերն առաջնորդվում են Պայմանագրով, ԸԴՊ-ով և ՀՀ օրենսդրությամբ։</S.TermsListPoint>
          <S.TermsListPoint>12.3. Կողմերի միջև Պայմանագրի կամ ԸԴՊ-ի հետ կապված կամ վերջիններիցս բխող ցանկացած վեճ լուծվում է բանակցությունների/հաշտարարության միջոցով, վեճի լուծումը հանձնելով «Բեսթ Սոլյուշնս» հաշտարարական գրասենյակին միջոցով:</S.TermsListPoint>
          <S.TermsListPoint>12.4. Բանակցությունների/հաշտարարության միջոցով վեճը չլուծվելու դեպքում Կողմերն իրավունք ունեն դիմել դատարան՝ համաձայն ՀՀ օրենսդրության:</S.TermsListPoint>
          <S.TermsListPoint>12.5. Վեճերի լուծման ընթացքում կողմերի միջև հաղորդակցությունը կատարվում է գրավոր՝ էլեկտրոնային փոստի հասցեներով, ինչպես նաև Կայքում նշված կոնտակտային տվյալներով:</S.TermsListPoint>
        </S.TermsList>
        <S.TermsSubTitle>13. ԵԶՐԱՓԱԿԻՉ ԴՐՈՒՅԹՆԵՐ</S.TermsSubTitle>
        <S.TermsList>
          <S.TermsListPoint>13.1. Պայմանագրի, ԸԴՊ-ի և լրացուցիչ համաձայնագրի դրույթների միջև տարբերությունների կամ հակասությունների դեպքում գերակայությունը տրվում է ըստ հետևյալ հաջորդականության՝</S.TermsListPoint>
          <S.TermsList>
            <S.TermsListPoint>Լրացուցիչ համաձայանգրի դրույթները գերակայում են Պայմանագրի և ԸԴՊ-ի դրույնթերի նկատմամբ,</S.TermsListPoint>
            <S.TermsListPoint>Պայմանագրի դրույթները գերակայում են ԸԴՊ-ի դրույթների նկատմամբ։</S.TermsListPoint>
          </S.TermsList>
          <S.TermsListPoint>13.2. Օգտատիրոջ ցանկացած հարց, առաջարկություն, մեկնաբանություն, բողոք և այլ գրագրություն պետք է ուղարկվի հետևյալ՝ support@korpus.am էլեկտրոնային հասցեով: Կայքը դրանք ստանալուց հետո 3 (երեք) աշխատանքային օրվա ընթացքում ներկայացնում է պատասխան: Օգտատերը սույնով համաձայն է և ընդունում է, որ իր կողմից Կազմակերպությանն ուղղված ցանկացած հարցի, դիմումի, առաջարկության, բողոքի կամ մեկնաբանության հիմնավորվածութան գնահատման և այն բավարարելու բացառիկ իրավունքը պատկանում է Կայքի իրավատիրոջը:</S.TermsListPoint>
          <S.TermsListPoint>13.3. Կայքի անբավարար աշխատանքի հետ կապված բողոքներ Կայքի կողմից չեն ընդունվում, եթե դրանք արդյունք են Օգտատիրոջ սարքավորումների կամ նրա ինտերնետ կապի անբավարար տեխնիկական հզորության, ինչպես նաև Օգտատիրոջ կողմից իր սարքավորումների կամ ծրագրային ապահովումների սխալ կարգաբերումների:</S.TermsListPoint>
          <S.TermsListPoint>13.4. Պայմանագիրն ուժի մեջ է մտնում Օգտատիրոջ կողմից Կայքում գրանցման պահից և գործում է մինչև այն պահը, երբ:</S.TermsListPoint>
          <S.TermsList>
            <S.TermsListPoint>Կայքը դադարում է գործել,</S.TermsListPoint>
            <S.TermsListPoint>Պայմանագրի խախտման դեպքում Օգտատիրոջ հետ հարաբերությունները դադարեցվում են։</S.TermsListPoint>
            <S.TermsListPoint>Պայմանագրով և ԸԴՊ-ով նախատեսված այլ դեպքերում:</S.TermsListPoint>
          </S.TermsList>
          <S.TermsListPoint>13.5. Գրանցվելով Կայքում, Օգտատերը հաստատում է իր անվերապահ համաձայնությունը ԸԴՊ-ի բոլոր դրույթներին, ինչպես նաև իր անձնական տվյալների համապատասխանությունը գրանցման համար ներկայացված բոլոր այն պայմաններին, որոնք անհրաժեշտ են Կայքում հաջողությամբ գրանցվելու համար: Կայքում գրանցվելը դիտարկվում է Պայմանագրի և ԸԴՊ-ի ստորագրում Ընկերության և օգտատիրոջ միջև։</S.TermsListPoint>
          <S.TermsListPoint>13.6. Ընկերությունն իրավունք ունի առանց նախապես ծանուցման, միակողմանի, ցանկացած պահի փոփոխել ԸԴՊ-ն։</S.TermsListPoint>
          <S.TermsListPoint>13.7. ԸԴՊ-ի փոփոխության դեպքում փոփոխված տարբերակը Ընկերությունը հրապարակելու է Կայքում՝ նշելով փոփոխության ամսաթիվը:</S.TermsListPoint>
          <S.TermsListPoint>13.8. Օգտատիրոջ համար</S.TermsListPoint>
          <S.TermsListPoint>13.9. ԸԴՊ-ի գործող տարբերակին (նոր խմբագրությամբ) ծանոթանալը հանդիսանում է Օգտատիրոջ պատասխանատվությունը (ԸԴՊ-ի գործող տարբերակը տեղադրվում է Կայքում՝ հետևյալ հասցեով / հղմամբ՝ «Ընդհանուր դրույթներ և պայմաններ»:</S.TermsListPoint>
          <S.TermsListPoint>13.10. Համաձայանգրում փոփոխություններ և/կամ լրացումներ կատարելուց հետո Կայքի տրամադրած ծառայություններից օգտվելը նշանակում է, որ Օգտատերը համաձայն է այդ փոփոխություններին և/կամ լրացումների հետ։</S.TermsListPoint>
          <S.TermsListPoint>13.11. Օգտատիրոջ համար ԸԴՊ-ի գործող տարբերակ է դիտարկվում տվյալ Պատվերի հաստատման պահին գործող ԸԴՊ-ն։</S.TermsListPoint>
         
        </S.TermsList>
        <S.TermsContent style={{fontWeight:"bold",marginTop:"20px"}}>ՍՈՒՅՆ ԸՆԴՀԱՆՈՒՐ ԴՐՈՒՅԹՆԵՐԸ ԵՎ ՊԱՅՄԱՆՆԵՐԸ ՀԱՆԴԻՍԱՆՈՒՄ ԵՆ «ՆԵԿԱ» ՍՊԸ-Ի ՍԵՓԱԿԱՆՈՒԹՅՈՒՆԸ․ ԸՆԴՕՐԻՆԱԿԵԼԸ ԵՎ ԿՐԿՆՕՐԻՆԱԿԵԼԸ ԱՐԳԵԼՎՈՒՄ Է։</S.TermsContent>
 
   
    </S.TermsContainer>
  );
};

export default TermsPage;