'use client';

import React, { useEffect, useState } from 'react';
import * as S from './page.styled';
import { BookText } from 'lucide-react';

const PrivacyPage = () => {
  const [data, setData] = useState(null);
 
  // if (!data) {
  //   return <div>Loading...</div>;
  // }

  return (
    <S.PrivacyContainer>
     
     <S.PrivacyTitle>
     Գաղտնիության քաղաքականություն<BookText size={32}/>
        </S.PrivacyTitle>
        <S.PrivacyContent>
        1. Ստորագրելով Պայմանագիրը՝ Օգտատերը տալիս է համաձայնությունը՝ Ընկերության կողմից իր անձնական տվյալների մշակմանը, ներառյալ ազգանունը, անունը, հայրանունը, կազմակերպության տվյալները, էլեկտրոնային փոստի հասցեն, կոնտակտային հեռախոսահամարը և այլ անհրաժեշտ տեղեկատվություն։
        </S.PrivacyContent>
        <S.PrivacyContent>
        2. Ընկերությունը պահպանում է Օգտատիրոջ անձնական տվյալները` ՀՀ օրենսդրության պահանջներին համապատասխան։
        </S.PrivacyContent>
        <S.PrivacyContent>
        3. Անձնական տվյալների անվտանգությունն ապահովվում է «Անձնական տվյալների պաշտպանության մասին» ՀՀ օրենքին համապատասխան։
        </S.PrivacyContent>
        <S.PrivacyContent>
        4. Ընկերությունը կարող է փոխանցել Օգտատիրոջ անձնական տվյալները երրորդ անձանց հետևյալ դեպքերում․
        </S.PrivacyContent>
        <S.PrivacyList>
        <dd>4.1 եթե Օգտատերը տվել է իր անձնական տվյալները փոխանցելու համաձայնությունը</dd>
        <dd>4.2 եթե փոխանցումն անհրաժեշտ է Օգտատիրոջը՝ Կայքի ծառայություններից օգտվելու համար,</dd>
        <dd>4.3 եթե փոխանցումը նախատեսված է ՀՀ օրենսդրությամբ և կատարվում է օրենքով սահմանված կարգով:</dd>
        </S.PrivacyList>
        <S.PrivacyContent>
        5. Օգտատերն իրավունք ունի փոփոխելու իր կողմից ներկայացված անձնական տվյալները:
        </S.PrivacyContent>
        <S.PrivacyContent>
        6. Օգտատերը համաձայն է և թույլ է տալիս Ընկերությանը իր էլեկտրոնային հասցեին ուղղարկել գովազդային ու տեղեկատվական նյութեր, առաջարկներ։
        </S.PrivacyContent>
        <S.PrivacyContent>
        7. Կայքում գրացվելու նպատակով Կայքին տրված Օգտատիրոջ անձնական տվյալները օգտագործվելու են հետևյալ ծառայությունների մատուցման համար՝
        </S.PrivacyContent>
        <S.PrivacyList>
          <li>փոխանցել տեղեկատվություն (այդ թվում գովազդ) Օգտատիրոջը,</li>
          <li>պատասխանել Օգտատիրոջ հարցերին,</li>
          <li>հրապարակել Օգտատիրոջ արձագանքները,</li>
          <li>պահպանել հետադարձ կապ Օգտատիրոջ հետ և ուղղարկել նորություններ։</li>
        </S.PrivacyList>
        <S.PrivacyContent>
        8. Ստորագրելով Պայմանագիրը՝ Օգտատերը տալիս է համաձայնություն՝ Կայքի Ադմինիստրացիայի կողմից իր անձնական տվյալների մշակմանը, մասնավորապես հետևյալ նպատակներով.
        </S.PrivacyContent>
        <S.PrivacyList>
          <li>ստանալ գովազդ,</li>
          <li>ստանալ SMS (WhatsApp) հաղորդագրություններ և հեռախոսազանգեր, </li>
          <li>ստանալ այլ ծառայություններ:</li>
        </S.PrivacyList>
        <S.PrivacyContent>
        Կայքի Ադմինիստրացիան պահպանում է Օգտատիրոջ անձնական տվյալները` ՀՀ օրենսդրության պահանջներին և իր ներքին կանոնակարգերին համապատասխան:
        </S.PrivacyContent>
      
 
  
    </S.PrivacyContainer>
  );
};

export default PrivacyPage;